In [78]:
import pandas as pd

In [156]:
# encoding 방법 : euc-kr, utf-8
score = pd.read_csv("score.csv", index_col = "과목", encoding = "euc_kr")
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

# 학급별 총계

In [157]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

# 과목별 총계

In [158]:
score.T

과목  수학  영어  국어  사회  과학
1반  45  76  47  92  11
2반  44  92  92  81  79
3반  73  45  45  85  47
4반  39  69  69  40  26

In [159]:
score.T.sum()

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [160]:
score.sum(axis = 1)

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

# score 데이터에 합계 칼럼 추가하기

In [161]:
score["합계"] = score.T.sum()
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [162]:
del score["합계"]

In [163]:
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

# 평균 column 추가
- 과목별 평균

In [164]:
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [165]:
score["평균"] = score.mean(axis = 1)

In [166]:
score

    1반  2반  3반  4반     평균
과목
수학  45  44  73  39  50.25
영어  76  92  45  69  70.50
국어  47  92  45  69  63.25
사회  92  81  85  40  74.50
과학  11  79  47  26  40.75

In [175]:
score["합계"] = score.loc["수학" : "과학", "1반" : "4반"].sum(axis = 1)
score

       1반    2반    3반    4반     평균     합계
과목
수학   45.0  44.0  73.0  39.0  50.25  201.0
영어   76.0  92.0  45.0  69.0  70.50  282.0
국어   47.0  92.0  45.0  69.0  63.25  253.0
사회   92.0  81.0  85.0  40.0  74.50  298.0
과학   11.0  79.0  47.0  26.0  40.75  163.0
반평균  54.2  77.6  59.0  48.6  59.85    NaN

In [176]:
score["합계"] = score.iloc[ :, :4].sum(axis = 1)
score

       1반    2반    3반    4반     평균     합계
과목
수학   45.0  44.0  73.0  39.0  50.25  201.0
영어   76.0  92.0  45.0  69.0  70.50  282.0
국어   47.0  92.0  45.0  69.0  63.25  253.0
사회   92.0  81.0  85.0  40.0  74.50  298.0
과학   11.0  79.0  47.0  26.0  40.75  163.0
반평균  54.2  77.6  59.0  48.6  59.85  239.4

# 반평균 row (행)추가하기

In [177]:
score.loc["반평균"] = score.mean()

In [178]:
score

       1반    2반    3반    4반     평균     합계
과목
수학   45.0  44.0  73.0  39.0  50.25  201.0
영어   76.0  92.0  45.0  69.0  70.50  282.0
국어   47.0  92.0  45.0  69.0  63.25  253.0
사회   92.0  81.0  85.0  40.0  74.50  298.0
과학   11.0  79.0  47.0  26.0  40.75  163.0
반평균  54.2  77.6  59.0  48.6  59.85  239.4

In [201]:
#반별 과목별 최댓값과 최소값을 구해보자
# maxArr : 최대값
# minArr : 최소값

# 과목별 최댓값
maxArr = score.loc[:"과학", :"4반"].max(axis = 1)
maxArr

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [200]:
#반 별 최댓값
maxArr = score.loc[:"과학", :"4반"].max()
maxArr

1반    92.0
2반    92.0
3반    85.0
4반    69.0
dtype: float64

In [202]:
# 과목별 최솟값
minArr = score.loc[:"과학",:"4반"].min(axis = 1)
minArr

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [203]:
#반 별 최솟값
minArr = score.loc[:"과학",:"4반"].min()
minArr

1반    11.0
2반    44.0
3반    45.0
4반    26.0
dtype: float64

In [211]:
def max_min(x):
    return x.max() - x.min()

In [ ]:
# apply(함수, axis = 1)

In [218]:
max_min(score.loc[:"과학", :"4반"])

1반    81.0
2반    48.0
3반    40.0
4반    43.0
dtype: float64

In [210]:
score.loc[:"과학", :"4반"].apply(max_min, axis = 1)

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [223]:
score.loc["전체합"] = score.loc[:,:"4반"].sum()

In [224]:
score

        1반     2반     3반     4반     평균     합계  최댓값
과목
수학    45.0   44.0   73.0   39.0  50.25  201.0   합계
영어    76.0   92.0   45.0   69.0  70.50  282.0   합계
국어    47.0   92.0   45.0   69.0  63.25  253.0   합계
사회    92.0   81.0   85.0   40.0  74.50  298.0   합계
과학    11.0   79.0   47.0   26.0  40.75  163.0   합계
반평균   54.2   77.6   59.0   48.6  59.85  239.4   합계
전체합  325.2  465.6  354.0  291.6    NaN    NaN  NaN

In [225]:
del score["최댓값"]

In [235]:
score

        1반     2반     3반     4반     평균     합계
과목
수학    45.0   44.0   73.0   39.0  50.25  201.0
영어    76.0   92.0   45.0   69.0  70.50  282.0
국어    47.0   92.0   45.0   69.0  63.25  253.0
사회    92.0   81.0   85.0   40.0  74.50  298.0
과학    11.0   79.0   47.0   26.0  40.75  163.0
반평균   54.2   77.6   59.0   48.6  59.85  239.4
전체합  325.2  465.6  354.0  291.6    NaN    NaN

In [236]:
# fillna() 함수
# 결측치를 원하는 값으로 바꿀 수 있다

In [240]:
# score에 넣지 않고 score.fillna(0)만 쓰면 실제 데이터 채워넣지는 않고 0으로 채워진 모습 보여주기만 하는것, 그러므로 넣어줘야함
score = score.fillna(0)
score

        1반     2반     3반     4반     평균     합계
과목
수학    45.0   44.0   73.0   39.0  50.25  201.0
영어    76.0   92.0   45.0   69.0  70.50  282.0
국어    47.0   92.0   45.0   69.0  63.25  253.0
사회    92.0   81.0   85.0   40.0  74.50  298.0
과학    11.0   79.0   47.0   26.0  40.75  163.0
반평균   54.2   77.6   59.0   48.6  59.85  239.4
전체합  325.2  465.6  354.0  291.6   0.00    0.0

In [241]:
# 카테고리

In [244]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
# 앞의 수 초과 뒤의 수 이하
bins = [0, 15, 25, 35, 60, 99]
labs = ["미성년자", "청년", "중년", "장년", "노년"]

In [245]:
# pd.cut(나눌데이터, 범위데이터, 라벨데이터)

In [246]:
cats = pd.cut(ages, bins, labels = labs)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 노년, 청년, 장년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [247]:
cats[0]

nan

In [248]:
cats[0:3]

[NaN, 미성년자, 미성년자]
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [254]:
ageArr = pd.DataFrame(ages, columns = ["나이"])
ageArr

     나이
0     0
1     2
2    10
3    21
4    23
5    37
6    31
7    61
8    20
9    41
10   32
11  100

In [255]:
ageArr["age_cat"] = cats

In [256]:
ageArr

     나이 age_cat
0     0     NaN
1     2    미성년자
2    10    미성년자
3    21      청년
4    23      청년
5    37      장년
6    31      중년
7    61      노년
8    20      청년
9    41      장년
10   32      중년
11  100     NaN

In [257]:
# 개수를 세어주는 함수
# value_counts()

In [260]:
ageArr["age_cat"].value_counts()

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: age_cat, dtype: int64